In [1]:
# Install required packages
%pip install jupysql sqlalchemy pandas --quiet

# Load SQL magic
%load_ext sql

# Connect to the database
%sql sqlite:///sql-murder-mystery.db

Note: you may need to restart the kernel to use updated packages.

Connecting to 'sqlite:///sql-murder-mystery.db'

In [2]:
%%sql
SELECT name
FROM sqlite_master
where type = 'table'

Running query in 'sqlite:///sql-murder-mystery.db'

+------------------------+
|          name          |
+------------------------+
|   crime_scene_report   |
|    drivers_license     |
| facebook_event_checkin |
|       interview        |
|   get_fit_now_member   |
|  get_fit_now_check_in  |
|        solution        |
|         income         |
|         person         |
+------------------------+

In [3]:
%%sql
SELECT sql
FROM sqlite_master
where name = 'crime_scene_report'

Running query in 'sqlite:///sql-murder-mystery.db'

+-----------------------------------+
|                sql                |
+-----------------------------------+
| CREATE TABLE crime_scene_report ( |
|               date integer,       |
|                 type text,        |
|             description text,     |
|                 city text         |
|                   )               |
+-----------------------------------+

In [32]:
%%sql
SELECT DISTINCT type FROM crime_scene_report;

Running query in 'sqlite:///sql-murder-mystery.db'

+-----------+
|    type   |
+-----------+
|  robbery  |
|   murder  |
|   theft   |
|   fraud   |
|   arson   |
|  bribery  |
|  assault  |
| smuggling |
| blackmail |
+-----------+

In [ ]:
%%sql
SELECT DISTINCT date FROM crime_scene_report

In [58]:
%%sql
SELECT *
FROM crime_scene_report
WHERE type = 'murder' AND date = 20180115

Running query in 'sqlite:///sql-murder-mystery.db'

+----------+--------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------+
|   date   |  type  |                                                                                        description                                                                                        |   city   |
+----------+--------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------+
| 20180115 | murder |                                                                             Life? Dont talk to me about life.                                                                             |  Albany  |
| 20180115 | murder |                                                                    Mama, I killed a man, put a gun against his head...                                                                    |   Reno   |
| 20180115 | murder | Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave". | SQL City |
+----------+--------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------+

In [14]:
%%sql
SELECT sql
FROM sqlite_master
where name = 'person'

Running query in 'sqlite:///sql-murder-mystery.db'

+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|                                                                                                            sql                                                                                                            |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| CREATE TABLE person (id integer PRIMARY KEY, name text, license_id integer, address_number integer, address_street_name text, ssn CHAR REFERENCES income (ssn), FOREIGN KEY (license_id) REFERENCES drivers_license (id)) |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

In [28]:
%%sql
SELECT *, MAX(address_number) 
FROM person
WHERE address_street_name = 'Northwestern Dr'

Running query in 'sqlite:///sql-murder-mystery.db'

+-------+----------------+------------+----------------+---------------------+-----------+---------------------+
|   id  |      name      | license_id | address_number | address_street_name |    ssn    | MAX(address_number) |
+-------+----------------+------------+----------------+---------------------+-----------+---------------------+
| 14887 | Morty Schapiro |   118009   |      4919      |   Northwestern Dr   | 111564949 |         4919        |
+-------+----------------+------------+----------------+---------------------+-----------+---------------------+

In [25]:
%%sql
SELECT *
FROM person
WHERE address_street_name = 'Franklin Ave' AND name LIKE 'Annabel %'

Running query in 'sqlite:///sql-murder-mystery.db'

+-------+----------------+------------+----------------+---------------------+-----------+
|   id  |      name      | license_id | address_number | address_street_name |    ssn    |
+-------+----------------+------------+----------------+---------------------+-----------+
| 16371 | Annabel Miller |   490173   |      103       |     Franklin Ave    | 318771143 |
+-------+----------------+------------+----------------+---------------------+-----------+

In [33]:
%%sql
SELECT sql
FROM sqlite_master
where name = 'interview'

Running query in 'sqlite:///sql-murder-mystery.db'

+-------------------------------------------------------+
|                          sql                          |
+-------------------------------------------------------+
|                CREATE TABLE interview (               |
|                       person_id integer,              |
|                        transcript text,               |
|         FOREIGN KEY (person_id) REFERENCES person(id) |
|                             )                         |
+-------------------------------------------------------+

In [35]:
%%sql
SELECT *
FROM interview
WHERE person_id = 14887 OR person_id = 16371

Running query in 'sqlite:///sql-murder-mystery.db'

+-----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| person_id |                                                                                                            transcript                                                                                                           |
+-----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|   14887   | I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W". |
|   16371   |                                                      I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.                                                      |
+-----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

In [37]:
%%sql
SELECT sql
FROM sqlite_master
where name = 'get_fit_now_check_in'

Running query in 'sqlite:///sql-murder-mystery.db'

+-----------------------------------------------------------------------+
|                                  sql                                  |
+-----------------------------------------------------------------------+
|                  CREATE TABLE get_fit_now_check_in (                  |
|                              membership_id text,                      |
|                             check_in_date integer,                    |
|                             check_in_time integer,                    |
|                            check_out_time integer,                    |
|         FOREIGN KEY (membership_id) REFERENCES get_fit_now_member(id) |
|                                     )                                 |
+-----------------------------------------------------------------------+

In [43]:
%%sql
SELECT *
FROM get_fit_now_check_in
WHERE check_in_date = 20180109 AND membership_id LIKE '48Z_%'

Running query in 'sqlite:///sql-murder-mystery.db'

+---------------+---------------+---------------+----------------+
| membership_id | check_in_date | check_in_time | check_out_time |
+---------------+---------------+---------------+----------------+
|     48Z7A     |    20180109   |      1600     |      1730      |
|     48Z55     |    20180109   |      1530     |      1700      |
+---------------+---------------+---------------+----------------+

In [44]:
%%sql
SELECT sql
FROM sqlite_master
where name = 'get_fit_now_member'

Running query in 'sqlite:///sql-murder-mystery.db'

+-------------------------------------------------------+
|                          sql                          |
+-------------------------------------------------------+
|           CREATE TABLE get_fit_now_member (           |
|                      id text PRIMARY KEY,             |
|                       person_id integer,              |
|                           name text,                  |
|                 membership_start_date integer,        |
|                    membership_status text,            |
|         FOREIGN KEY (person_id) REFERENCES person(id) |
|                             )                         |
+-------------------------------------------------------+

In [46]:
%%sql
SELECT *
FROM get_fit_now_member
WHERE id = '48Z7A' OR id = '48Z55'

Running query in 'sqlite:///sql-murder-mystery.db'

+-------+-----------+---------------+-----------------------+-------------------+
|   id  | person_id |      name     | membership_start_date | membership_status |
+-------+-----------+---------------+-----------------------+-------------------+
| 48Z55 |   67318   | Jeremy Bowers |        20160101       |        gold       |
| 48Z7A |   28819   |  Joe Germuska |        20160305       |        gold       |
+-------+-----------+---------------+-----------------------+-------------------+

In [72]:
%%sql  
SELECT *
FROM interview
WHERE person_id = 67318 OR person_id = 28819 -- Jeremy Bowers is the killer

Running query in 'sqlite:///sql-murder-mystery.db'

+-----------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| person_id |                                                                                                                    transcript                                                                                                                    |
+-----------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|   67318   | I was hired by a woman with a lot of money. I don't know her name but I know she's around 5'5" (65") or 5'7" (67"). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017. |
|           |                                                                                                                                                                                                                                                  |
+-----------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

In [74]:
%%sql
SELECT *
FROM drivers_license
WHERE gender = 'female' AND hair_color = 'red' AND car_make = 'Tesla'

Running query in 'sqlite:///sql-murder-mystery.db'

+--------+-----+--------+-----------+------------+--------+--------------+----------+-----------+
|   id   | age | height | eye_color | hair_color | gender | plate_number | car_make | car_model |
+--------+-----+--------+-----------+------------+--------+--------------+----------+-----------+
| 202298 |  68 |   66   |   green   |    red     | female |    500123    |  Tesla   |  Model S  |
| 291182 |  65 |   66   |    blue   |    red     | female |    08CM64    |  Tesla   |  Model S  |
| 918773 |  48 |   65   |   black   |    red     | female |    917UU3    |  Tesla   |  Model S  |
+--------+-----+--------+-----------+------------+--------+--------------+----------+-----------+

In [ ]:
%%sql
SELECT sql
FROM sqlite_master
where name = 'facebook_event_checkin'

Running query in 'sqlite:///sql-murder-mystery.db'

+-------------------------------------------------------+
|                          sql                          |
+-------------------------------------------------------+
|         CREATE TABLE facebook_event_checkin (         |
|                       person_id integer,              |
|                       event_id integer,               |
|                        event_name text,               |
|                         date integer,                 |
|         FOREIGN KEY (person_id) REFERENCES person(id) |
|                             )                         |
+-------------------------------------------------------+

In [86]:
%%sql
SELECT * 
FROM facebook_event_checkin
WHERE event_name = 'SQL Symphony Concert' AND date LIKE '201712_%'
GROUP BY person_id
HAVING COUNT(*) = 3

Running query in 'sqlite:///sql-murder-mystery.db'

+-----------+----------+----------------------+----------+
| person_id | event_id |      event_name      |   date   |
+-----------+----------+----------------------+----------+
|   24556   |   1143   | SQL Symphony Concert | 20171207 |
|   99716   |   1143   | SQL Symphony Concert | 20171206 |
+-----------+----------+----------------------+----------+

In [96]:
%%sql
SELECT *
FROM person
WHERE id = 24556 OR id = 99716
-- Miranda Priestly hired Jeremy Bowers to commit a murder

Running query in 'sqlite:///sql-murder-mystery.db'

+-------+------------------+------------+----------------+---------------------+-----------+
|   id  |       name       | license_id | address_number | address_street_name |    ssn    |
+-------+------------------+------------+----------------+---------------------+-----------+
| 24556 |   Bryan Pardo    |   101191   |      703       |      Machine Ln     | 816663882 |
| 99716 | Miranda Priestly |   202298   |      1883      |      Golden Ave     | 987756388 |
+-------+------------------+------------+----------------+---------------------+-----------+

In [97]:
%%sql
SELECT *
FROM income
WHERE ssn = 987756388

Running query in 'sqlite:///sql-murder-mystery.db'

+-----------+---------------+
|    ssn    | annual_income |
+-----------+---------------+
| 987756388 |     310000    |
+-----------+---------------+